; domain
(define (domain lec-winter-split-macros)
    (:requirements :strips :typing :equality :negative-preconditions)
    (:types match team referee server slot - object)
    (:constants home away - slot)

    (:predicates
        (connected ?m1 - match ?m2 - match ?s - slot)
        (participant ?t - team ?m - match ?s - slot)
        (ref-available ?r - referee)
        (server-available ?s - server)
        
        ;; Predicados de estado necesarios para el grafo
        (verified ?m - match) 
        (winner-determined ?m - match)
        (winner ?m - match ?t - team)
        
        ;; Flag de control
        (has-conflict ?m - match)
    )

    ;; MACRO 1: Partido Normal Completo
    ;; Secuencia: Draft -> PlayClean -> Sign -> Verify
    (:action macro-complete-match-clean
        :parameters (?m - match ?s - server ?r - referee ?t - team)
        :precondition (and 
            (participant ?t ?m home) ;; Asumimos gana home
            (not (verified ?m))
            (ref-available ?r)
            (server-available ?s)
            (not (has-conflict ?m))  ;; Solo si NO hay conflicto
        )
        :effect (and 
            (verified ?m)
            (winner-determined ?m)
            (winner ?m ?t)
            ;; Los recursos entran y salen, el estado neto es neutral
        )
    )

    ;; MACRO 2: Partido con Incidencia Resuelta (Ruling)
    ;; Secuencia: Draft -> PlayBug -> Protest -> RulingConfirm -> Sign -> Verify
    (:action macro-complete-match-with-ruling
        :parameters (?m - match ?s - server ?r - referee ?t - team)
        :precondition (and 
            (participant ?t ?m home)
            (not (verified ?m))
            (ref-available ?r)
            (server-available ?s)
            (has-conflict ?m)        ;; Solo si HAY conflicto
        )
        :effect (and 
            (verified ?m)
            (winner-determined ?m)
            (winner ?m ?t)
        )
    )

    ;; MACRO 3: Partido con Replay (Costoso)
    ;; Secuencia: Draft -> PlayBug -> Protest -> Replay -> PlayClean -> Sign -> Verify
    ;; Nota: Esta macro asume que tras el replay se juega limpio.
    (:action macro-complete-match-with-replay
        :parameters (?m - match ?s - server ?r - referee ?t - team)
        :precondition (and 
            (participant ?t ?m home)
            (not (verified ?m))
            (ref-available ?r)
            (server-available ?s)
            (has-conflict ?m)        ;; Se dispara por conflicto
        )
        :effect (and 
            (verified ?m)
            (winner-determined ?m)
            (winner ?m ?t)
            ;; En un modelo con costes, aquí pondrías (increase (total-cost) 50)
        )
    )

    ;; MACRO 4: No Show (Administrativo)
    (:action macro-admin-noshow
        :parameters (?m - match ?t - team)
        :precondition (and 
            (participant ?t ?m home)
            (not (verified ?m))
            ;; No requiere recursos
        )
        :effect (and 
            (verified ?m)
            (winner-determined ?m)
            (winner ?m ?t)
        )
    )

    ;; Acción de Avanzar (Igual que en el normal)
    (:action promote-to-next-round
        :parameters (?m_src - match ?m_dst - match ?t - team ?s - slot)
        :precondition (and 
            (winner-determined ?m_src)
            (winner ?m_src ?t)
            (connected ?m_src ?m_dst ?s)
        )
        :effect (and 
            (participant ?t ?m_dst ?s)
        )
    )
)

; problem
(define (problem lec-128-R16-S16-P40)
    (:domain lec-winter-split-macros)
    (:objects
        team-1 team-2 team-3 team-4 team-5 team-6 team-7 team-8 team-9 team-10 team-11 team-12 team-13 team-14 team-15 team-16 team-17 team-18 team-19 team-20 team-21 team-22 team-23 team-24 team-25 team-26 team-27 team-28 team-29 team-30 team-31 team-32 team-33 team-34 team-35 team-36 team-37 team-38 team-39 team-40 team-41 team-42 team-43 team-44 team-45 team-46 team-47 team-48 team-49 team-50 team-51 team-52 team-53 team-54 team-55 team-56 team-57 team-58 team-59 team-60 team-61 team-62 team-63 team-64 team-65 team-66 team-67 team-68 team-69 team-70 team-71 team-72 team-73 team-74 team-75 team-76 team-77 team-78 team-79 team-80 team-81 team-82 team-83 team-84 team-85 team-86 team-87 team-88 team-89 team-90 team-91 team-92 team-93 team-94 team-95 team-96 team-97 team-98 team-99 team-100 team-101 team-102 team-103 team-104 team-105 team-106 team-107 team-108 team-109 team-110 team-111 team-112 team-113 team-114 team-115 team-116 team-117 team-118 team-119 team-120 team-121 team-122 team-123 team-124 team-125 team-126 team-127 team-128 - team
        m1 m2 m3 m4 m5 m6 m7 m8 m9 m10 m11 m12 m13 m14 m15 m16 m17 m18 m19 m20 m21 m22 m23 m24 m25 m26 m27 m28 m29 m30 m31 m32 m33 m34 m35 m36 m37 m38 m39 m40 m41 m42 m43 m44 m45 m46 m47 m48 m49 m50 m51 m52 m53 m54 m55 m56 m57 m58 m59 m60 m61 m62 m63 m64 m65 m66 m67 m68 m69 m70 m71 m72 m73 m74 m75 m76 m77 m78 m79 m80 m81 m82 m83 m84 m85 m86 m87 m88 m89 m90 m91 m92 m93 m94 m95 m96 m97 m98 m99 m100 m101 m102 m103 m104 m105 m106 m107 m108 m109 m110 m111 m112 m113 m114 m115 m116 m117 m118 m119 m120 m121 m122 m123 m124 m125 m126 m127 - match
        ref-1 ref-2 ref-3 ref-4 ref-5 ref-6 ref-7 ref-8 ref-9 ref-10 ref-11 ref-12 ref-13 ref-14 ref-15 ref-16 - referee
        server-1 server-2 server-3 server-4 server-5 server-6 server-7 server-8 server-9 server-10 server-11 server-12 server-13 server-14 server-15 server-16 - server
    )
    (:init
        (ref-available ref-1)
        (ref-available ref-2)
        (ref-available ref-3)
        (ref-available ref-4)
        (ref-available ref-5)
        (ref-available ref-6)
        (ref-available ref-7)
        (ref-available ref-8)
        (ref-available ref-9)
        (ref-available ref-10)
        (ref-available ref-11)
        (ref-available ref-12)
        (ref-available ref-13)
        (ref-available ref-14)
        (ref-available ref-15)
        (ref-available ref-16)
        (server-available server-1)
        (server-available server-2)
        (server-available server-3)
        (server-available server-4)
        (server-available server-5)
        (server-available server-6)
        (server-available server-7)
        (server-available server-8)
        (server-available server-9)
        (server-available server-10)
        (server-available server-11)
        (server-available server-12)
        (server-available server-13)
        (server-available server-14)
        (server-available server-15)
        (server-available server-16)
        (participant team-1 m1 home)
        (participant team-2 m1 away)
        (participant team-3 m2 home)
        (participant team-4 m2 away)
        (participant team-5 m3 home)
        (participant team-6 m3 away)
        (participant team-7 m4 home)
        (participant team-8 m4 away)
        (participant team-9 m5 home)
        (participant team-10 m5 away)
        (participant team-11 m6 home)
        (participant team-12 m6 away)
        (participant team-13 m7 home)
        (participant team-14 m7 away)
        (participant team-15 m8 home)
        (participant team-16 m8 away)
        (participant team-17 m9 home)
        (participant team-18 m9 away)
        (participant team-19 m10 home)
        (participant team-20 m10 away)
        (participant team-21 m11 home)
        (participant team-22 m11 away)
        (participant team-23 m12 home)
        (participant team-24 m12 away)
        (participant team-25 m13 home)
        (participant team-26 m13 away)
        (participant team-27 m14 home)
        (participant team-28 m14 away)
        (participant team-29 m15 home)
        (participant team-30 m15 away)
        (participant team-31 m16 home)
        (participant team-32 m16 away)
        (participant team-33 m17 home)
        (participant team-34 m17 away)
        (participant team-35 m18 home)
        (participant team-36 m18 away)
        (participant team-37 m19 home)
        (participant team-38 m19 away)
        (participant team-39 m20 home)
        (participant team-40 m20 away)
        (participant team-41 m21 home)
        (participant team-42 m21 away)
        (participant team-43 m22 home)
        (participant team-44 m22 away)
        (participant team-45 m23 home)
        (participant team-46 m23 away)
        (participant team-47 m24 home)
        (participant team-48 m24 away)
        (participant team-49 m25 home)
        (participant team-50 m25 away)
        (participant team-51 m26 home)
        (participant team-52 m26 away)
        (participant team-53 m27 home)
        (participant team-54 m27 away)
        (participant team-55 m28 home)
        (participant team-56 m28 away)
        (participant team-57 m29 home)
        (participant team-58 m29 away)
        (participant team-59 m30 home)
        (participant team-60 m30 away)
        (participant team-61 m31 home)
        (participant team-62 m31 away)
        (participant team-63 m32 home)
        (participant team-64 m32 away)
        (participant team-65 m33 home)
        (participant team-66 m33 away)
        (participant team-67 m34 home)
        (participant team-68 m34 away)
        (participant team-69 m35 home)
        (participant team-70 m35 away)
        (participant team-71 m36 home)
        (participant team-72 m36 away)
        (participant team-73 m37 home)
        (participant team-74 m37 away)
        (participant team-75 m38 home)
        (participant team-76 m38 away)
        (participant team-77 m39 home)
        (participant team-78 m39 away)
        (participant team-79 m40 home)
        (participant team-80 m40 away)
        (participant team-81 m41 home)
        (participant team-82 m41 away)
        (participant team-83 m42 home)
        (participant team-84 m42 away)
        (participant team-85 m43 home)
        (participant team-86 m43 away)
        (participant team-87 m44 home)
        (participant team-88 m44 away)
        (participant team-89 m45 home)
        (participant team-90 m45 away)
        (participant team-91 m46 home)
        (participant team-92 m46 away)
        (participant team-93 m47 home)
        (participant team-94 m47 away)
        (participant team-95 m48 home)
        (participant team-96 m48 away)
        (participant team-97 m49 home)
        (participant team-98 m49 away)
        (participant team-99 m50 home)
        (participant team-100 m50 away)
        (participant team-101 m51 home)
        (participant team-102 m51 away)
        (participant team-103 m52 home)
        (participant team-104 m52 away)
        (participant team-105 m53 home)
        (participant team-106 m53 away)
        (participant team-107 m54 home)
        (participant team-108 m54 away)
        (participant team-109 m55 home)
        (participant team-110 m55 away)
        (participant team-111 m56 home)
        (participant team-112 m56 away)
        (participant team-113 m57 home)
        (participant team-114 m57 away)
        (participant team-115 m58 home)
        (participant team-116 m58 away)
        (participant team-117 m59 home)
        (participant team-118 m59 away)
        (participant team-119 m60 home)
        (participant team-120 m60 away)
        (participant team-121 m61 home)
        (participant team-122 m61 away)
        (participant team-123 m62 home)
        (participant team-124 m62 away)
        (participant team-125 m63 home)
        (participant team-126 m63 away)
        (participant team-127 m64 home)
        (participant team-128 m64 away)
        (connected m1 m65 home)
        (connected m2 m65 away)
        (connected m3 m66 home)
        (connected m4 m66 away)
        (connected m5 m67 home)
        (connected m6 m67 away)
        (connected m7 m68 home)
        (connected m8 m68 away)
        (connected m9 m69 home)
        (connected m10 m69 away)
        (connected m11 m70 home)
        (connected m12 m70 away)
        (connected m13 m71 home)
        (connected m14 m71 away)
        (connected m15 m72 home)
        (connected m16 m72 away)
        (connected m17 m73 home)
        (connected m18 m73 away)
        (connected m19 m74 home)
        (connected m20 m74 away)
        (connected m21 m75 home)
        (connected m22 m75 away)
        (connected m23 m76 home)
        (connected m24 m76 away)
        (connected m25 m77 home)
        (connected m26 m77 away)
        (connected m27 m78 home)
        (connected m28 m78 away)
        (connected m29 m79 home)
        (connected m30 m79 away)
        (connected m31 m80 home)
        (connected m32 m80 away)
        (connected m33 m81 home)
        (connected m34 m81 away)
        (connected m35 m82 home)
        (connected m36 m82 away)
        (connected m37 m83 home)
        (connected m38 m83 away)
        (connected m39 m84 home)
        (connected m40 m84 away)
        (connected m41 m85 home)
        (connected m42 m85 away)
        (connected m43 m86 home)
        (connected m44 m86 away)
        (connected m45 m87 home)
        (connected m46 m87 away)
        (connected m47 m88 home)
        (connected m48 m88 away)
        (connected m49 m89 home)
        (connected m50 m89 away)
        (connected m51 m90 home)
        (connected m52 m90 away)
        (connected m53 m91 home)
        (connected m54 m91 away)
        (connected m55 m92 home)
        (connected m56 m92 away)
        (connected m57 m93 home)
        (connected m58 m93 away)
        (connected m59 m94 home)
        (connected m60 m94 away)
        (connected m61 m95 home)
        (connected m62 m95 away)
        (connected m63 m96 home)
        (connected m64 m96 away)
        (connected m65 m97 home)
        (connected m66 m97 away)
        (connected m67 m98 home)
        (connected m68 m98 away)
        (connected m69 m99 home)
        (connected m70 m99 away)
        (connected m71 m100 home)
        (connected m72 m100 away)
        (connected m73 m101 home)
        (connected m74 m101 away)
        (connected m75 m102 home)
        (connected m76 m102 away)
        (connected m77 m103 home)
        (connected m78 m103 away)
        (connected m79 m104 home)
        (connected m80 m104 away)
        (connected m81 m105 home)
        (connected m82 m105 away)
        (connected m83 m106 home)
        (connected m84 m106 away)
        (connected m85 m107 home)
        (connected m86 m107 away)
        (connected m87 m108 home)
        (connected m88 m108 away)
        (connected m89 m109 home)
        (connected m90 m109 away)
        (connected m91 m110 home)
        (connected m92 m110 away)
        (connected m93 m111 home)
        (connected m94 m111 away)
        (connected m95 m112 home)
        (connected m96 m112 away)
        (connected m97 m113 home)
        (connected m98 m113 away)
        (connected m99 m114 home)
        (connected m100 m114 away)
        (connected m101 m115 home)
        (connected m102 m115 away)
        (connected m103 m116 home)
        (connected m104 m116 away)
        (connected m105 m117 home)
        (connected m106 m117 away)
        (connected m107 m118 home)
        (connected m108 m118 away)
        (connected m109 m119 home)
        (connected m110 m119 away)
        (connected m111 m120 home)
        (connected m112 m120 away)
        (connected m113 m121 home)
        (connected m114 m121 away)
        (connected m115 m122 home)
        (connected m116 m122 away)
        (connected m117 m123 home)
        (connected m118 m123 away)
        (connected m119 m124 home)
        (connected m120 m124 away)
        (connected m121 m125 home)
        (connected m122 m125 away)
        (connected m123 m126 home)
        (connected m124 m126 away)
        (connected m125 m127 home)
        (connected m126 m127 away)
        (has-conflict m1)
        (has-conflict m3)
        (has-conflict m6)
        (has-conflict m7)
        (has-conflict m9)
        (has-conflict m13)
        (has-conflict m16)
        (has-conflict m18)
        (has-conflict m19)
        (has-conflict m21)
        (has-conflict m24)
        (has-conflict m27)
        (has-conflict m31)
        (has-conflict m33)
        (has-conflict m34)
        (has-conflict m36)
        (has-conflict m37)
        (has-conflict m39)
        (has-conflict m40)
        (has-conflict m42)
        (has-conflict m46)
        (has-conflict m52)
        (has-conflict m53)
        (has-conflict m54)
        (has-conflict m55)
        (has-conflict m60)
        (has-conflict m63)
        (has-conflict m65)
        (has-conflict m68)
        (has-conflict m70)
        (has-conflict m72)
        (has-conflict m75)
        (has-conflict m77)
        (has-conflict m78)
        (has-conflict m80)
        (has-conflict m83)
        (has-conflict m85)
        (has-conflict m87)
        (has-conflict m88)
        (has-conflict m89)
        (has-conflict m90)
        (has-conflict m93)
        (has-conflict m94)
        (has-conflict m95)
        (has-conflict m99)
        (has-conflict m100)
        (has-conflict m104)
        (has-conflict m106)
        (has-conflict m107)
        (has-conflict m108)
        (has-conflict m109)
        (has-conflict m112)
        (has-conflict m115)
        (has-conflict m124)
        (has-conflict m126)
    )
    (:goal
        (verified m127)
    )
)

; plan
1. (macro-admin-noshow m1 team-1)
   added: (verified m1) (winner-determined m1) (winner m1 team-1)
   goals met: 0 of 1
2. (promote-to-next-round m1 m65 team-1 home)
   added: (participant team-1 m65 home)
   goals met: 0 of 1
3. (macro-admin-noshow m65 team-1)
   added: (verified m65) (winner-determined m65) (winner m65 team-1)
   goals met: 0 of 1
4. (promote-to-next-round m65 m97 team-1 home)
   added: (participant team-1 m97 home)
   goals met: 0 of 1
5. (macro-admin-noshow m97 team-1)
   added: (verified m97) (winner-determined m97) (winner m97 team-1)
   goals met: 0 of 1
6. (promote-to-next-round m97 m113 team-1 home)
   added: (participant team-1 m113 home)
   goals met: 0 of 1
7. (macro-admin-noshow m113 team-1)
   added: (verified m113) (winner-determined m113) (winner m113 team-1)
   goals met: 0 of 1
8. (promote-to-next-round m113 m121 team-1 home)
   added: (participant team-1 m121 home)
   goals met: 0 of 1
9. (macro-admin-noshow m121 team-1)
   added: (verified m121) (winner-determined m121) (winner m121 team-1)
   goals met: 0 of 1
10. (promote-to-next-round m121 m125 team-1 home)
   added: (participant team-1 m125 home)
   goals met: 0 of 1
11. (macro-admin-noshow m125 team-1)
   added: (verified m125) (winner-determined m125) (winner m125 team-1)
   goals met: 0 of 1
12. (promote-to-next-round m125 m127 team-1 home)
   added: (participant team-1 m127 home)
   goals met: 0 of 1
13. (macro-admin-noshow m127 team-1)
   added: (verified m127) (winner-determined m127) (winner m127 team-1)
   goals met: 1 of 1
